## Pandas DataFrame
## 20180725
## Sungjae Lee

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [9]:
raw_data = {'first_name':['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
           'last_name':['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
           'age':[42, 52, 36, 24, 73],
           'city':['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [11]:
DataFrame(raw_data, columns = ['age', 'city'])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [12]:
DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt'])

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [15]:
print(df.loc[1])

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [16]:
print(df['age'])

0    42
1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [49]:
# Example from - https://stackoverflow.com/questions/31593201/pandas-iloc-vs-ix-vs-loc-explanation
s = pd.Series(np.nan, index=[49,48,47,46,45, 1, 2, 3, 4, 5])
print(s.iloc[:-2])
print(s.loc[:3])

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64
49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [50]:
s.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

In [51]:
df['debt'] = df['age'] > 40
df['debt']

0     True
1     True
2    False
3    False
4     True
Name: debt, dtype: bool

In [52]:
df

  first_name last_name  age           city  sex   debt
0      Jason    Miller   42  San Francisco    M   True
1      Molly  Jacobson   52      Baltimore    F   True
2       Tina       Ali   36          Miami  NaN  False
3       Jake    Milner   24        Douglas    F  False
4        Amy     Cooze   73         Boston  NaN   True

In [31]:
values = Series({0:'M', 1:'F', 3:'F'})

In [53]:
values

0    M
1    F
3    F
dtype: object

In [54]:
df['sex'] = values
df

  first_name last_name  age           city  sex   debt
0      Jason    Miller   42  San Francisco    M   True
1      Molly  Jacobson   52      Baltimore    F   True
2       Tina       Ali   36          Miami  NaN  False
3       Jake    Milner   24        Douglas    F  False
4        Amy     Cooze   73         Boston  NaN   True

In [39]:
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True
sex                     M          F    NaN        F     NaN

In [40]:
df.values

array([['Jason', 'Miller', 42, 'San Francisco', True, 'M'],
       ['Molly', 'Jacobson', 52, 'Baltimore', True, 'F'],
       ['Tina', 'Ali', 36, 'Miami', False, nan],
       ['Jake', 'Milner', 24, 'Douglas', False, 'F'],
       ['Amy', 'Cooze', 73, 'Boston', True, nan]], dtype=object)

In [55]:
df.to_csv('dataframe_test.csv')

In [56]:
del df["debt"]
df

  first_name last_name  age           city  sex
0      Jason    Miller   42  San Francisco    M
1      Molly  Jacobson   52      Baltimore    F
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas    F
4        Amy     Cooze   73         Boston  NaN

In [57]:
df

  first_name last_name  age           city  sex
0      Jason    Miller   42  San Francisco    M
1      Molly  Jacobson   52      Baltimore    F
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas    F
4        Amy     Cooze   73         Boston  NaN

In [58]:
# Example from Python for data analyis
pop = {'Nevada':{2001:2.4, 2002:2.9},
      'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}}
DataFrame(pop)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6